# Tutorial-3: Dataframe Slicing and replacing values
### Import pandas library

In [118]:
import pandas as pd

In [133]:
### Creating a dataframe
dict={'Column1':[23,34,None,23,78],  #Note entering of a missing value
     'Column2':[12,31,35,67,89],
     'Column3':[14,43,95,24,76],
     'Column4':[34,67,35,65,78]}
df=pd.DataFrame(dict,columns=['Column1','Column2','Column3','Column4'])

In [134]:
df

   Column1  Column2  Column3  Column4
0     23.0       12       14       34
1     34.0       31       43       67
2      NaN       35       95       35
3     23.0       67       24       65
4     78.0       89       76       78

### By label -- use 'loc'

In [135]:
df.loc[[0],['Column2']] # Select single value by label

   Column2
0       12

In [136]:
df.loc[:2,'Column3'] #Column3 values for rows 0 to 2(inclusive)

0    14
1    43
2    95
Name: Column3, dtype: int64

In [137]:
df.loc[:2,['Column3','Column1']] #Column3 and 1 values for rows 0 to 2(inclusive)

   Column3  Column1
0       14     23.0
1       43     34.0
2       95      NaN

### By Position -- use 'iloc'

In [138]:
df.iloc[[0],[0]] # Select single value by position (0,0)

   Column1
0     23.0

In [139]:
# Slice dataframe from rows 0 to 3(exclusive) and cloumns 0 to 2(exclusive)
df.iloc[:3, :2]

   Column1  Column2
0     23.0       12
1     34.0       31
2      NaN       35

In [140]:
df.iloc[:3, ]

   Column1  Column2  Column3  Column4
0     23.0       12       14       34
1     34.0       31       43       67
2      NaN       35       95       35

In [141]:
df.iloc[3:, ]

   Column1  Column2  Column3  Column4
3     23.0       67       24       65
4     78.0       89       76       78

In [142]:
df.iloc[:,2]

0    14
1    43
2    95
3    24
4    76
Name: Column3, dtype: int64

In [143]:
df.iloc[0,] # prints row#0

Column1    23.0
Column2    12.0
Column3    14.0
Column4    34.0
Name: 0, dtype: float64

In [144]:
df.iloc[:,0] # prints column#0

0    23.0
1    34.0
2     NaN
3    23.0
4    78.0
Name: Column1, dtype: float64

## Replacing values

In [147]:
#using a dictionary to replace all 23s with 3 and a;; 78s with 590
df = df.replace({23: 3, 78: 590})

In [148]:
df

   Column1  Column2  Column3  Column4
0      3.0       12       14       34
1     34.0       31       43       67
2      NaN       35       95       35
3      3.0       67       24       65
4    590.0       89       76      590

In [151]:
# Only replace values for Column 1, but dont change it in other columns
df = df.replace({'Column1': {3: 237, 590: 370}}) 
df

   Column1  Column2  Column3  Column4
0    237.0       12       14       34
1     34.0       31       43       67
2      NaN       35       95       35
3    237.0       67       24       65
4    370.0       89       76      590

In [154]:
# Change value 34 in Column1 and value 67 in Column2 to 1000.
df = df.replace({'Column1': 34, 'Column2':67}, 1000)
df

   Column1  Column2  Column3  Column4
0    237.0       12       14       34
1   1000.0       31       43       67
2      NaN       35       95       35
3    237.0     1000       24       65
4    370.0       89       76      590

### Using Regular expressions to replace values

In [158]:
df = pd.DataFrame({'A': ['bat', 'foo', 'bait'],
                   'B': ['abc', 'bar', 'xyz']})

In [159]:
df

      A    B
0   bat  abc
1   foo  bar
2  bait  xyz

In [162]:
df.replace(to_replace=r'^ba.$', value='new', regex=True) 
# or use
df.replace(regex=r'^ba.$', value='new')

      A    B
0   new  abc
1   foo  new
2  bait  xyz

In [165]:
# Only replace it for column 'A'
df.replace({'A': r'^ba.$'}, {'A': 'new'}, regex=True)

      A    B
0   new  abc
1   foo  bar
2  bait  xyz

In [167]:
# You can combine regex with non-regex replacement
df.replace(regex={r'^ba.$': 'new', 'foo': 'xyz'})

      A    B
0   new  abc
1   xyz  new
2  bait  xyz